In [1]:
import pandas as pd

#isnull()...count total null values in dataframe

In [5]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\practice.csv')
df

   A   B    C  D    E
0  1  12  9.0  4  2.0
1  2  23  8.0  3  3.0
2  3  34  NaN  2  4.0
3  4  45  NaN  1  NaN
4  5  56  5.0  0  NaN

In [6]:
df.isnull()

       A      B      C      D      E
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False   True  False  False
3  False  False   True  False   True
4  False  False  False  False   True

In [7]:
df.isnull().sum()

A    0
B    0
C    2
D    0
E    2
dtype: int64

In [8]:
df.isnull().sum().sum()

4

In [9]:
df.notnull()

      A     B      C     D      E
0  True  True   True  True   True
1  True  True   True  True   True
2  True  True  False  True   True
3  True  True  False  True  False
4  True  True   True  True  False

In [10]:
df.notnull().sum()

A    5
B    5
C    3
D    5
E    3
dtype: int64

In [11]:
df.notnull().sum().sum()

21

#for series()....

In [12]:
import numpy as np
sr=pd.Series([3,4,5,np.nan,8,9,np.NaN])
sr

0    3.0
1    4.0
2    5.0
3    NaN
4    8.0
5    9.0
6    NaN
dtype: float64

In [13]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [14]:
sr.isnull().sum()

2

In [15]:
sr.isnull().sum().sum()

2

In [16]:
sr.notnull()

0     True
1     True
2     True
3    False
4     True
5     True
6    False
dtype: bool

In [17]:
sr.notnull().sum()

5